var dataArr = [{
    roleName: '纳兹',
    imgsrc: './images/zq-nz-role1.png',
    roleinfo: '火之灭龙魔导士，他可以使用将自身体质变换为龙的灭龙魔法。搭档是一只名叫哈比的猫。经常和露西一起行动。抚养他长大成人的火龙伊古尼尔曾突然消失不见，而纳兹则一直在寻找着它1。'
}, {
    roleName: '露西',
    imgsrc: './images/zq-lx-role1.png',
    roleinfo: '妖精尾巴公会的新人魔导士。星灵魔导士，用门之钥匙召唤异界的星灵，并且使用只有契约者才能操控的魔法。和纳兹以及哈比相遇后，加入妖精的尾巴。现在则是公会中不可缺少的一员。'
}, {
    roleName: '格雷',
    imgsrc: './images/zq-gl-role1.png',
    roleinfo: '将冰变为各种造型，当做武器来战斗的冰之造型魔导士。 他的造型速度非常快，其他造型魔导士根本无法比拟。有喜欢脱衣服的怪癖，但实力在公会中是顶尖水平。'
}, {
    roleName: '艾露莎',
    imgsrc: './images/zq-als-role1.png',
    roleinfo: '身穿铠甲，是妖精的尾巴中最强的女魔导士。拥有“妖精女王”的别名。战斗时使用骑士魔法，瞬间用武器、铠甲进行换装（召唤出储存在其他空间的武器和铠甲）。是妖精的尾巴中屈指可数的S级魔导士之一。'
},{
    roleName: '纳兹1',
    imgsrc: './images/zq-nz-role1.png',
    roleinfo: '火之灭龙魔导士，他可以使用将自身体质变换为龙的灭龙魔法。搭档是一只名叫哈比的猫。经常和露西一起行动。抚养他长大成人的火龙伊古尼尔曾突然消失不见，而纳兹则一直在寻找着它1。'
}, {
    roleName: '露西2',
    imgsrc: './images/zq-lx-role1.png',
    roleinfo: '妖精尾巴公会的新人魔导士。星灵魔导士，用门之钥匙召唤异界的星灵，并且使用只有契约者才能操控的魔法。和纳兹以及哈比相遇后，加入妖精的尾巴。现在则是公会中不可缺少的一员。'
}, {
    roleName: '格雷3',
    imgsrc: './images/zq-gl-role1.png',
    roleinfo: '将冰变为各种造型，当做武器来战斗的冰之造型魔导士。 他的造型速度非常快，其他造型魔导士根本无法比拟。有喜欢脱衣服的怪癖，但实力在公会中是顶尖水平。'
}, {
    roleName: '艾露莎4',
    imgsrc: './images/zq-als-role1.png',
    roleinfo: '身穿铠甲，是妖精的尾巴中最强的女魔导士。拥有“妖精女王”的别名。战斗时使用骑士魔法，瞬间用武器、铠甲进行换装（召唤出储存在其他空间的武器和铠甲）。是妖精的尾巴中屈指可数的S级魔导士之一。'
}]